theFoamHouse/FoamCases/ppWallGrad/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linear;
}

laplacianSchemes
{
    default         none;
	laplacian(nu,U) Gauss linear orthogonal ;
	laplacian((1|A(U)),p) Gauss linear orthogonal ;
}

interpolationSchemes
{
    default         linear;
	interpolate (HbyA) linear ;
}

snGradSchemes
{
    default         orthogonal;
}
fluxRequired
{
	default no;
	p ;
}

// ************************************************************************* //
