theFoamHouse/FoamCases/ppWallGrad/system/patchIntegrate
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the surface integral of fields on a patch.

\*---------------------------------------------------------------------------*/

patch   inlet;

fields  (phi);

operation areaIntegrate;

#includeEtc "caseDicts/postProcessing/surfaceFieldValue/patchValue.cfg"

// ************************************************************************* //
